NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
/*!
    \file    wifi_netlink.c
    \brief   Operations of wifi netlink for GD32VW55x SDK.

    \version 2023-07-20, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "rom_export.h"
#include "wifi_vif.h"
#ifdef CONFIG_WPA_SUPPLICANT
#include "common/ieee802_11_defs.h"
#endif
#include "wifi_management.h"
#include "wifi_export.h"
#include "wifi_net_ip.h"
#include "wifi_wpa.h"
#include "wifi_init.h"
#include "debug_print.h"
#include "dhcpd.h"
#include "nvds_flash.h"
#include "gd32vw55x_platform.h"

// If WiFi has been closed or not
uint8_t wifi_work_status = WIFI_RUNNING;
const char *wifi_closed_warn = "WiFi has been closed. Please open WiFi first.\r\n";
const char *wifi_closing_warn = "WiFi is closing. Please wait for a minute.\r\n";

#ifdef CONFIG_WPA_SUPPLICANT
#define macif_cmd_send      macif_cntrl_cmd_send_cli
#else
#define STA_MGMT_RX_FILTER ~(CO_BIT(WLAN_FC_STYPE_ACTION) \
                            | CO_BIT(WLAN_FC_STYPE_DEAUTH) \
                            | CO_BIT(WLAN_FC_STYPE_DISASSOC))

#define macif_cmd_send      macif_ctl_cmd_execute
#endif

extern void wpa_debug_level_set(uint32_t level);
/*!
    \brief      Close wifi debug log
    \param[in]  none
    \param[out] none
    \retval     0.
*/
int wifi_netlink_dbg_close(void)
{
    /* level: [0-7]- NONE|CRT|ERR|WRN|NTC|STAT|INF|VRB */
    /* module: Bit[0-11]- KE|DBG|IPC|DMA|MM|TX|RX|PHY|PS|WDG|RC|ME */
    macif_dbg_filter_set(0, 0);

#ifdef CONFIG_WPA_SUPPLICANT
    /* level: [0-5]- EXCESSIVE|MSGDUMP|DEBUG|INFO|WARNING|ERROR */
    wpa_debug_level_set(5);
#else
    wpas_info_print_close();
#endif

    global_debug_level = NONE;

    return 0;
}

/*!
    \brief      Open wifi debug log
    \param[in]  none
    \param[out] none
    \retval     0.
*/
int wifi_netlink_dbg_open(void)
{
    /* level: [0-7]- NONE|CRT|ERR|WRN|NTC|STAT|INF|VRB */
    /* module: Bit[0-11]- KE|DBG|IPC|DMA|MM|TX|RX|PHY|PS|WDG|RC|ME */
    macif_dbg_filter_set(4, 0xFFF);

#ifdef CONFIG_WPA_SUPPLICANT
    /* level: [0-5]- EXCESSIVE|MSGDUMP|DEBUG|INFO|WARNING|ERROR */
    wpa_debug_level_set(3);
#else
    wpas_info_print_open();
#endif

    global_debug_level = NOTICE;

    return 0;
}

/*!
    \brief      Print wifi status
    \param[in]  none
    \param[out] none
    \retval     0.
*/
int wifi_netlink_status_print(void)
{
    struct wifi_vif_tag *wvif;
    int i, j;

    printf("WIFI Status:\r\n");
    printf("==============================\r\n");
    for (i = 0; i < CFG_VIF_NUM; i++) {
        wvif =  &wifi_vif_tab[i];
        if (wvif->mac_vif == NULL) {
            #ifdef CFG_WIFI_CONCURRENT
            if (wifi_management_concurrent_get())
                printf("WiFi VIF[%d]: INACTIVE\r\n", i);
            #endif
            continue;
        }
        printf("WiFi VIF[%d]: "MAC_FMT"\r\n", i, MAC_ARG(wvif->mac_addr.array));
        if (wvif->wvif_type == WVIF_STA) {
            printf("\tSTA\r\n");
            printf("\t Status: ");
            if (wvif->sta.state <= WIFI_STA_STATE_SCAN)
                printf("Disconnected\r\n");
            else if (wvif->sta.state <= WIFI_STA_STATE_IP_GETTING)
                printf("Connecting\r\n");
            else if (wvif->sta.state == WIFI_STA_STATE_CONNECTED)
                printf("Connected\r\n");
            else
                printf("Unknown\r\n");
            if (wvif->sta.state >= WIFI_STA_STATE_CONNECT) {
                printf("\t SSID: %s\r\n", wvif->sta.cfg.ssid);
                printf("\t BSSID: "MAC_FMT"\r\n", MAC_ARG((uint16_t *)wvif->sta.cfg.bssid));
                printf("\t Channel: %d\r\n", wvif->sta.cfg.channel);
                printf("\t Bandwidth: ");
                if (wvif->sta.cfg.bw == PHY_CHNL_BW_20)
                    printf("20MHz\r\n");
                else if (wvif->sta.cfg.bw == PHY_CHNL_BW_40)
                    printf("40MHz\r\n");
                else
                    printf("Unknown\r\n");
                printf("\t Security: ");
                if (wvif->sta.cfg.akm & CO_BIT(MAC_AKM_SAE))
                    printf("WPA3\t\n");
                else if (wvif->sta.cfg.akm == (CO_BIT(MAC_AKM_PSK) | CO_BIT(MAC_AKM_PRE_RSN)))
                    printf("WPA\t\n");
                else if (wvif->sta.cfg.akm == CO_BIT(MAC_AKM_PSK))
                    printf("WPA2\t\n");
                else if (wvif->sta.cfg.akm == CO_BIT(MAC_AKM_NONE))
                    printf("OPEN\t\n");
                else
                    printf("Unknown\t\n");
                printf("\t RSSI: %d\r\n", macif_vif_sta_rssi_get(i));
            }
            if (wvif->sta.state >= WIFI_STA_STATE_IP_GETTING) {
                struct wifi_ip_addr_cfg ip_cfg;
                wifi_get_vif_ip(i, &ip_cfg);
                printf("\t IP: "IP_FMT"\r\n", IP_ARG(ip_cfg.ipv4.addr));
                printf("\t GW: "IP_FMT"\r\n", IP_ARG(ip_cfg.ipv4.gw));
                #ifdef CONFIG_IPV6_SUPPORT
                {
                    char ip6_local[40] = {0};
                    char ip6_unique[40] = {0};
                    if (!wifi_get_vif_ip6(i, ip6_local, ip6_unique)) {
                        printf("\t IP6_local: [%s]\r\n", ip6_local);
                        printf("\t IP6_uniqe: [%s]\r\n", ip6_unique);
                    }
                }
                #endif
            }
        } else if (wvif->wvif_type == WVIF_AP) {
            struct wifi_ip_addr_cfg ip_cfg;
            struct mac_addr cli_mac[CFG_STA_NUM];
            int cli_num;

            printf("\tSoftAP\r\n");
            printf("\t Status: ");
            if (wvif->ap.ap_state == WIFI_AP_STATE_INIT)
                printf("Disconnected\r\n");
            else if (wvif->ap.ap_state == WIFI_AP_STATE_STARTED)
                printf("Started\r\n");
            /*else if (wvif->ap.ap_state == WIFI_AP_STATE_BEFORE_CHANNEL_SWITCH)
                printf("Before Channel Switch\r\n");*/
            else
                printf("Unknown\t\n");
            if (wvif->ap.ap_state == WIFI_AP_STATE_STARTED) {
                printf("\t SSID: %s\r\n", wvif->ap.cfg.ssid);
                printf("\t Channel: %d\r\n", wvif->ap.cfg.channel);
            }
            printf("\t Security: ");
            if (wvif->ap.cfg.akm == CO_BIT(MAC_AKM_NONE))
                printf("OPEN\t\n");
            else if (wvif->ap.cfg.akm == (CO_BIT(MAC_AKM_PSK) | CO_BIT(MAC_AKM_PRE_RSN)))
                printf("WPA\t\n");
            else if (wvif->ap.cfg.akm == CO_BIT(MAC_AKM_PSK))
                printf("WPA2\t\n");
            else if (wvif->ap.cfg.akm == CO_BIT(MAC_AKM_SAE))
                printf("WPA3\t\n");
            else if (wvif->ap.cfg.akm == (CO_BIT(MAC_AKM_PSK) | CO_BIT(MAC_AKM_SAE)))
                printf("WPA2/WPA3\t\n");
            else
                printf("Unknown\t\n");
            wifi_get_vif_ip(i, &ip_cfg);
            printf("\t IP: "IP_FMT"\r\n", IP_ARG(ip_cfg.ipv4.addr));
            printf("\t GW: "IP_FMT"\r\n", IP_ARG(ip_cfg.ipv4.gw));
            #ifdef CONFIG_IPV6_SUPPORT
            {
                char ip6_local[40] = {0};
                char ip6_unique[40] = {0};
                if (!wifi_get_vif_ip6(i, ip6_local, ip6_unique)) {
                    printf("\t IP6_local: [%s]\r\n", ip6_local);
                    printf("\t IP6_uniqe: [%s]\r\n", ip6_unique);
                }
            }
            #endif

            cli_num = macif_vif_ap_assoc_info_get(i, (uint16_t *)&cli_mac);
            for (j = 0; j < cli_num; j++) {
                printf("\t Client[%d]: "MAC_FMT"   "IP_FMT"\r\n",
                    j, MAC_ARG(cli_mac[j].array), IP_ARG(dhcpd_find_ipaddr_by_macaddr((uint8_t *)cli_mac[j].array)));
            }

        } else if (wvif->wvif_type == WVIF_MONITOR) {
            printf("\tMonitor\r\n");
        } else if (wvif->wvif_type == WVIF_UNKNOWN) {
            printf("\tUnknown\r\n");
        }
    }

    printf("\r\n");

