NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    return 0;
}

/*!
    \brief      Print one result of wifi scan
    \param[in]  idx: index of the scanned AP
    \param[in]  result: pointer to the result of wifi scan
    \param[out] none
    \retval     none
*/
void wifi_netlink_scan_result_print(int idx, struct mac_scan_result *result)
{
    char sep __MAYBE_UNUSED;
    uint16_t mfp, group_cipher;
    uint8_t *bssid __MAYBE_UNUSED;
    int i;

    bssid = (uint8_t *)result->bssid.array;
    if (result->ssid.length < sizeof(result->ssid.array))
        result->ssid.array[result->ssid.length] = '\0';
    else
        result->ssid.array[result->ssid.length - 1] = '\0';

    netlink_printf("[%d] (%d dBm) CH=%3d BSSID=%02x:%02x:%02x:%02x:%02x:%02x SSID=%s ",
                idx,
                result->rssi,
                wifi_freq_to_channel(result->chan->freq),
                bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5],
                (char *)result->ssid.array);

    if (result->akm & CO_BIT(MAC_AKM_NONE))
    {
        netlink_printf("[OPEN]\n");
        return;
    }

    if (result->akm == CO_BIT(MAC_AKM_PRE_RSN))
    {
        netlink_printf("[WEP]\n");
        return;
    }

    if (result->akm & CO_BIT(MAC_AKM_WAPI_CERT) ||
        result->akm & CO_BIT(MAC_AKM_WAPI_PSK))
    {
        bool cert __MAYBE_UNUSED = result->akm & CO_BIT(MAC_AKM_WAPI_CERT);
        bool psk __MAYBE_UNUSED = result->akm & CO_BIT(MAC_AKM_WAPI_PSK);
        netlink_printf("[WAPI:%s%s%s %s/%s]\n",
                    cert ? "CERT" : "",
                    cert && psk ? "-" : "",
                    psk ? "PSK" : "",
                    result->group_cipher == CO_BIT(MAC_CIPHER_WPI_SMS4) ? "SMS4" : "?",
                    result->pairwise_cipher == CO_BIT(MAC_CIPHER_WPI_SMS4) ?
                    "SMS4" : "?");
        return;
    }

    if (result->akm & CO_BIT(MAC_AKM_PRE_RSN))
        netlink_printf(" [WPA");
    else
        netlink_printf(" [RSN");

    sep = ':';
    for (i = MAC_AKM_8021X; i <= MAC_AKM_DPP; i++)
    {
        if (result->akm & CO_BIT(i))
        {
            netlink_printf("%c%s", sep, wpa_akm_str[i]);
            sep = ',';
        }
    }

    sep = ' ';
    for (i = MAC_CIPHER_WEP40; i <= MAC_CIPHER_BIP_CMAC_256; i++)
    {
        if (result->pairwise_cipher & CO_BIT(i))
        {
            netlink_printf("%c%s", sep, wpa_cipher_str[i]);
            sep = ',';
        }
    }
    netlink_printf("/");

    group_cipher = result->group_cipher;
    mfp = (CO_BIT(MAC_CIPHER_BIP_CMAC_128) | CO_BIT(MAC_CIPHER_BIP_GMAC_128) |
           CO_BIT(MAC_CIPHER_BIP_GMAC_256) | CO_BIT(MAC_CIPHER_BIP_CMAC_256));
    mfp = group_cipher & mfp;
    group_cipher &= ~(mfp);

    if (group_cipher) {
        i = 31 - co_clz(group_cipher);
        if (i < MAC_CIPHER_BIP_CMAC_256)
            netlink_printf("%s", wpa_cipher_str[i]);
    } else
        netlink_printf("?");

    if (mfp) {
        netlink_printf("][MFP");
        sep = ':';
        for (i = MAC_CIPHER_BIP_CMAC_128; i <= MAC_CIPHER_BIP_CMAC_256; i++) {
            if (mfp & CO_BIT(i)) {
                netlink_printf("%c%s", sep, wpa_cipher_str[i]);
                sep = ',';
            }
        }
    }
    netlink_printf("]\n");
}

/*!
    \brief      Print all results of wifi scan
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  callback: callback func to print result of wifi scan
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_scan_results_print(int vif_idx, void (*callback)(int, struct mac_scan_result *))
{
    uint32_t result_cnt = 0;
    struct macif_scan_results *results;
    int idx;

    results = (struct macif_scan_results *)sys_malloc(sizeof(struct macif_scan_results));
    if (NULL == results)
        return -1;

    if (wifi_netlink_scan_results_get(vif_idx, results)) {
        sys_mfree(results);
        return -2;
    }

    result_cnt = results->result_cnt;
    for (idx = 0; idx < result_cnt; idx++) {
        if (callback)
            callback(idx, &results->result[idx]);
    }

    sys_mfree(results);
    return 0;
}

/*!
    \brief      Find the specified AP in the results of wifi scan
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  bssid: pointer to the bssid of the AP
    \param[in]  ssid: pointer to the ssid of the AP
    \param[in]  candidate: pointer to the result of wifi scan
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_candidate_ap_find(int vif_idx, uint8_t *bssid, char *ssid, struct mac_scan_result *candidate)
{
    struct macif_scan_results *results = NULL;
    struct mac_scan_result *result;
    int idx, ret = 0;
    int bssid_valid = 0;
    int max_rssi = -255;
    int found = 0;
    uint32_t result_cnt = 0;

    if (vif_idx >= CFG_VIF_NUM) {
        return -1;
    }

    if (bssid)
        bssid_valid = 1;
    if (!bssid_valid && (NULL == ssid)) {
        return -2;
    }

    results = (struct macif_scan_results *) sys_zalloc(sizeof(struct macif_scan_results));
    if (NULL == results) {
        return -3;
    }
    if (wifi_netlink_scan_results_get(vif_idx, results)) {
        ret = -4;
        goto Exit;
    }

    result_cnt = results->result_cnt;
    for (idx = 0; idx < result_cnt; idx++) {
        result = &results->result[idx];
        if (bssid_valid) {
            if (0 == sys_memcmp(bssid, (uint8_t *)result->bssid.array, WIFI_ALEN)) {
                if (result->rssi > max_rssi) {
                    found++;
                    sys_memcpy(candidate, result, sizeof(*candidate));
                    max_rssi = result->rssi;
                }
            }
        } else {
            if ((strlen(ssid) == result->ssid.length)
                && (strncmp(ssid, (char *)result->ssid.array, result->ssid.length) == 0)) {
                if (result->rssi > max_rssi) {
                    found++;
                    sys_memcpy(candidate, result, sizeof(*candidate));
                    max_rssi = result->rssi;
                }
            }
        }
    }

    if (found == 0) {
        if (bssid_valid)
            netlink_printf("Can not found candidate AP: "MAC_FMT".\r\n", MAC_ARG_UINT8(bssid));
        else
            netlink_printf("Can not found candidate AP: %s.\r\n", ssid);
        ret = -5;
    }

