NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
Exit:
    sys_mfree(results);

    return ret;
}

/*!
    \brief      Set whether to enable auto connection
    \param[in]  auto_conn_enable: 0: disble; 1: enable
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_auto_conn_set(uint8_t auto_conn_enable)
{
    return nvds_data_put(NULL, NVDS_NS_WIFI_INFO, WIFI_AUTO_CONN_EN,
                        (uint8_t *)(&auto_conn_enable), sizeof(uint8_t));
}

/*!
    \brief      Get whether to enable auto connection
    \param[in]  none
    \param[out] none
    \retval     0: disble; 1: enable.
*/
uint8_t wifi_netlink_auto_conn_get(void)
{
    uint8_t auto_conn_enable;
    uint8_t flash_data_len = sizeof(uint8_t);

    int ret = nvds_data_get(NULL, NVDS_NS_WIFI_INFO, WIFI_AUTO_CONN_EN,
                            (uint8_t *)(&auto_conn_enable), (uint32_t *)(&flash_data_len));
    if (ret != 0) {
        auto_conn_enable = 0;
    }

    return auto_conn_enable;
}

/*!
    \brief      Store infomation of connected AP if enable auto connection
    \param[in]  cfg: pointer to the information of AP
    \param[in]  ip: IP address
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_joined_ap_store(struct sta_cfg *cfg, uint32_t ip)
{
    struct auto_conn_info info;
    uint32_t total_len;

    //ip
    info.ip_addr = ip;

    //channel
    info.channel = cfg->channel;

    //ssid
    info.ssid.length = cfg->ssid_len;
    sys_memcpy(info.ssid.array, (uint8_t *)cfg->ssid, info.ssid.length);

    //key
    info.key.length = cfg->passphrase_len;
    sys_memcpy(info.key.array, cfg->passphrase, info.key.length);

    /* only store the valid key length */
    total_len = sizeof(uint32_t) + sizeof(uint8_t) + sizeof(info.ssid) + info.key.length + 1;

    netlink_printf("Store ssid = %s passphrase = %s channel = %d ip = "IP_FMT"\r\n",
                    cfg->ssid, cfg->passphrase, cfg->channel, IP_ARG(info.ip_addr));

    return nvds_data_put(NULL, NVDS_NS_WIFI_INFO, WIFI_AUTO_CONN_AP_INFO, (uint8_t *)(&info), total_len);
}

/*!
    \brief      Load infomation of connected AP which saved previously if enable auto connection
    \param[in]  vif_idx: index of the wifi vif
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_joined_ap_load(int vif_idx)
{
    struct wifi_vif_tag *wvif = &wifi_vif_tab[vif_idx];
    struct sta_cfg *cfg = &wvif->sta.cfg;
    struct auto_conn_info info;
    uint32_t flash_data_len = sizeof(struct auto_conn_info);
    int ret;

    ret = nvds_data_get(NULL, NVDS_NS_WIFI_INFO, WIFI_AUTO_CONN_AP_INFO,
                        (uint8_t *)(&info), &flash_data_len);
    if (ret != 0) {
        return ret;
    }
    if ((info.ssid.length > MAC_SSID_LEN) || (info.key.length > WPA_MAX_PSK_LEN)) {
        return -1;
    }
    cfg->ssid_len = info.ssid.length;
    sys_memcpy(cfg->ssid, info.ssid.array, cfg->ssid_len);
    cfg->passphrase_len = info.key.length;
    sys_memcpy(cfg->passphrase, info.key.array, cfg->passphrase_len);
    cfg->channel = info.channel;

    wvif->sta.history_ip = info.ip_addr;
    netlink_printf("Load ssid = %s passphrase = %s channel = %d ip = "IP_FMT"\r\n",
                    cfg->ssid, cfg->passphrase, cfg->channel, IP_ARG(info.ip_addr));

    return 0;
}

/*!
    \brief      Config and start wifi scan
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  channel: channel to be scanned
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_scan_set(int vif_idx, uint8_t channel)
{
    struct macif_cmd_scan cmd;
    struct macif_cmd_resp resp;
    struct macif_scan_ssid ssid = {NULL, 0};
    int freq;

    if ((channel < 1) || ((channel > 14) && (channel != 0xFF)))
        return -1;

    sys_memset((void *)&cmd, 0, sizeof(cmd));
    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_SCAN_CMD;
    cmd.vif_idx = vif_idx;
    if (channel == 0xFF) {
        /* all channels */
        cmd.freqs = NULL;
    } else {
        /* specified channel */
        freq = wifi_channel_to_freq(channel);
        cmd.freqs = &freq;
    }
    cmd.extra_ies = NULL;
    cmd.bssid = NULL;
    cmd.ssids = &ssid;
    cmd.extra_ies_len = 0;
    cmd.no_cck = 0;
    cmd.ssid_cnt = 1;
    cmd.duration = 0;
    cmd.passive = false;
    cmd.sock = -1;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS))
        return -2;
    return 0;
}

/*!
    \brief      Config and start wifi scan, but only scan the specified AP
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  ssid: pointer to the ssid of the AP
    \param[in]  channel: channel to be scanned
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_scan_set_with_ssid(int vif_idx, char *ssid, uint8_t channel)
{
    struct macif_cmd_scan cmd;
    struct macif_cmd_resp resp;
    struct macif_scan_ssid scan_ssid = {NULL, 0};
    char str_ssid[MAC_SSID_MAX_LEN + 1];
    int freq;

    if ((NULL == ssid) || strlen(ssid) > MAC_SSID_MAX_LEN)
        return -1;

    if ((channel < 1) || ((channel > 14) && (channel != 0xFF)))
        return -2;

    sys_memset((void *)&cmd, 0, sizeof(cmd));

    scan_ssid.len = strlen(ssid);
    strcpy(str_ssid, ssid);
    scan_ssid.ssid = str_ssid;
    cmd.ssids = &scan_ssid;
    cmd.ssid_cnt = 1;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_SCAN_CMD;
    cmd.vif_idx = vif_idx;
    if (0xFF == channel) {
        /* all channels */
        cmd.freqs = NULL;
    } else {
        /* specified channel */
        freq = wifi_channel_to_freq(channel);
        cmd.freqs = &freq;
    }
    cmd.extra_ies = NULL;
    cmd.bssid = NULL;
    cmd.extra_ies_len = 0;
    cmd.no_cck = 0;
    cmd.duration = 0;
    cmd.passive = false;
    cmd.sock = -1;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS))
        return -3;
    return 0;
}

/*!
    \brief      Get results of wifi scan
    \param[in]  vif_idx: index of the wifi vif
    \param[out] results: pointer to the result of wifi scan
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_scan_results_get(int vif_idx, struct macif_scan_results *results)
{
    struct macif_cmd_scan_results cmd;
    struct macif_scan_results_resp resp;

    if (vif_idx >= CFG_VIF_NUM) {
        return -1;
    }

    if (NULL == results) {
        return -2;
    }

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_GET_SCAN_RESULTS_CMD;
    cmd.vif_idx = vif_idx;
    resp.results = results;

