NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    if (macif_cmd_send(&cmd.hdr, &resp.hdr)) {
        return -3;
    }

    return 0;
}

#ifdef CFG_SOFTAP
/*!
    \brief      Start softap
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  cfg: pointer to the config of softap
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_ap_start(int vif_idx, struct ap_cfg *cfg)
{
    struct wifi_vif_tag *wvif;
    struct ap_cfg *ap_cfg;
    struct wifi_ip_addr_cfg ip_cfg;
    int res = 0;

    if (vif_idx >= CFG_VIF_NUM)
        return -1;

    wvif =  &wifi_vif_tab[vif_idx];
    if (wvif->wvif_type != WVIF_AP)
        return -2;

    if (VIF_AP != macif_vif_type_get(vif_idx)) {
        return -3;
    }

    /* 1. copy cfg to wifi vif */
    ap_cfg = &wvif->ap.cfg;
    if (cfg) {
        if (cfg->ssid_len == 0 || cfg->channel == 0)
            return -4;

        sys_memcpy(ap_cfg, cfg, sizeof(struct ap_cfg));

        if (ap_cfg->akm & CO_BIT(MAC_AKM_SAE)) {
            if (ap_cfg->akm & CO_BIT(MAC_AKM_PSK)) {
                // MFP is optional in WPA2/WP3 transition mode
                ap_cfg->mfp = 1;
            } else {
                 // MFP is mandatory in SAE
                ap_cfg->mfp = 2;
            }
        } else {
            ap_cfg->mfp = 0;
        }
        ap_cfg->he_disabled = 0;
#ifdef CFG_WIFI_CONCURRENT
        ap_cfg->bcn_interval = 113;
#else
        ap_cfg->bcn_interval = 100;
#endif
        ap_cfg->dtim_period = 1;
    }

    /* 2. inform wpas to start softap */
    res = wifi_wpa_ap_sm_step(vif_idx, WIFI_MGMT_EVENT_START_AP_CMD, (uint8_t *)ap_cfg, sizeof(struct ap_cfg));
    if (res) {
        netlink_printf("%s: ap start failed, res %d\r\n", __func__, res);
        return -4;
    }

    /* 3. Set IP */
    sys_memset(&ip_cfg, 0, sizeof(ip_cfg));
    ip_cfg.mode = IP_ADDR_DHCP_SERVER;
#ifdef CONFIG_IPV6_SUPPORT
    ip_cfg.ip6_mode = IP6_ADDR_SERVER;
#endif
    ip_cfg.default_output = true;
    ip_cfg.ipv4.addr = PP_HTONL(LWIP_MAKEU32(192, 168, 237, 1));
    ip_cfg.ipv4.mask = PP_HTONL(LWIP_MAKEU32(255, 255, 255, 0));
    ip_cfg.ipv4.gw = PP_HTONL(LWIP_MAKEU32(192, 168, 237, 1));
    wifi_set_vif_ip(vif_idx, &ip_cfg);

    /* 4. Set mac vif state */
    macif_vif_ap_state_set(vif_idx, AP_OPEN);
    macif_vif_ap_isolation_set(vif_idx, false);

    netlink_printf("IP: "IP_FMT"/24\r\n", IP_ARG(ip_cfg.ipv4.addr));
    netlink_printf("GW: "IP_FMT"/24\r\n", IP_ARG(ip_cfg.ipv4.gw));
    return 0;
}

/*!
    \brief      Stop softap
    \param[in]  vif_idx: index of the wifi vif
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_ap_stop(int vif_idx)
{
    struct wifi_vif_tag *wvif;
    struct wifi_ip_addr_cfg ip_cfg;

    if (vif_idx >= CFG_VIF_NUM)
        return -1;

    wvif = vif_idx_to_wvif(vif_idx);
    if (wvif->wvif_type != WVIF_AP || macif_vif_type_get(vif_idx) != VIF_AP)
        return 0;

    if (wvif->ap.ap_state != WIFI_AP_STATE_STARTED)
        return 0;

    /* 1. stop wpas softap */
    wifi_wpa_ap_sm_step(vif_idx, WIFI_MGMT_EVENT_STOP_AP_CMD, NULL, 0);

    /* 2. stop dhcpd and reset ip */
    ip_cfg.mode = IP_ADDR_NONE;
#ifdef CONFIG_IPV6_SUPPORT
    ip_cfg.ip6_mode = IP6_ADDR_NONE;
#endif
    wifi_set_vif_ip(vif_idx, &ip_cfg);

    /* 3. stop mac softap */
    macif_vif_ap_state_set(vif_idx, AP_CLOSE);

    return 0;
}
#endif /* CFG_SOFTAP */

static void monitor_cb_default(struct wifi_frame_info *info, void *arg)
{
    if (info->payload == NULL)
    {
        netlink_printf("Unsupported frame: length = %d\r\n", info->length);
    }
    else
    {
        struct mac_hdr *hdr __MAYBE_UNUSED = (struct mac_hdr *)info->payload;
        netlink_printf(MAC_FMT" "MAC_FMT" "MAC_FMT" FCTL %x SN:%d length = %d\r\n", MAC_ARG(hdr->addr1.array),
                  MAC_ARG(hdr->addr2.array), MAC_ARG(hdr->addr3.array),
                  hdr->fctl, hdr->seq >> 4, info->length);
    }
}

/*!
    \brief      Start monitor
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  cfg: pointer to the config of monitor
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_monitor_start(int vif_idx, struct wifi_monitor *cfg)
{
    struct wifi_vif_tag *wvif;
    struct macif_cmd_monitor_cfg cmd = {0};
    struct macif_cmd_resp resp;
    struct mac_chan_def *chan;
    struct wifi_monitor *mon = NULL;

    if (vif_idx >= CFG_VIF_NUM || cfg == NULL)
        return -1;

    wvif = vif_idx_to_wvif(vif_idx);
    if (wvif->wvif_type != WVIF_MONITOR || macif_vif_type_get(vif_idx) != VIF_MONITOR)
        return -2;

    mon = &wifi_vif_tab[vif_idx].monitor;
    if (mon != cfg) {
        mon->cb = cfg->cb;
        mon->cb_arg = cfg->cb_arg;
        mon->channel = cfg->channel;
        mon->uf = cfg->uf;
    }

#ifdef CONFIG_WPA_SUPPLICANT
    wifi_wpa_link_monitor(vif_idx, 1);  //TODO??
    //wifi_wpa_link_monitor(vif_idx, 0);
#endif

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_MONITOR_CFG_CMD;
    cmd.vif_idx = vif_idx;

    cmd.chan.prim20_freq = wifi_channel_to_freq(cfg->channel);
    // by default 20Mhz bandwidth
    cmd.chan.type = PHY_CHNL_BW_20;
    cmd.chan.center1_freq = cmd.chan.prim20_freq;
    cmd.chan.center2_freq = 0;

    cmd.uf = cfg->uf;
    if (cfg->cb)
        cmd.cb = cfg->cb;
    else
        cmd.cb = monitor_cb_default;
    cmd.cb_arg = cfg->cb_arg;

    chan = (struct mac_chan_def *)macif_wifi_chan_get(cmd.chan.prim20_freq);
    if (!chan)
        return -3;

    cmd.chan.tx_power = chan->tx_power;
    cmd.chan.band = chan->band;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS))
        return -4;

    return 0;
}

/*!
    \brief      Set wifi channel
    \param[in]  channel: wifi channel
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_channel_set(uint32_t channel)
{
    struct macif_cmd_set_channel cmd;
    struct macif_set_channel_resp resp;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_SET_CHANNEL_CMD;
    cmd.chan_idx = channel;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) || (resp.status != MACIF_STATUS_SUCCESS))
        return -1;

