NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    return 0;
}

/*!
    \brief      Set power save mode
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  ps_mode: power save mode
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_ps_mode_set(int vif_idx, uint8_t ps_mode)
{
    struct macif_cmd_set_ps_mode cmd;
    struct macif_cmd_resp resp;

    if (ps_mode == 0) {
        cmd.enabled = false;
    } else if (ps_mode == 1 || ps_mode == 2) {
        cmd.enabled = true;
    } else {
        return -1;
    }

    cmd.ps_mode = ps_mode;
    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_SET_PS_MODE_CMD;
    cmd.vif_idx = vif_idx;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr))
        return -1;

    return 0;
}

int wifi_netlink_priv_req(uint32_t type, uint32_t param1, uint32_t param2, uint32_t *result)
{
    struct macif_cmd_do_priv_req cmd;
    struct macif_do_priv_resp resp;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_DO_PRIV_REQ_CMD;

    cmd.req_type = (WIFI_PRIV_REQ_E)type;
    cmd.param1 = param1;
    cmd.param2 = param2;
    cmd.result = result;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS))
        return MACIF_STATUS_ERROR;

    return MACIF_STATUS_SUCCESS;
}

int wifi_netlink_ext_priv_req(uint32_t type, uint32_t param1, uint32_t param2, uint32_t param3,
                                        uint32_t param4, uint32_t *result)
{
    struct macif_cmd_do_priv_req cmd;
    struct macif_do_priv_resp resp;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_DO_PRIV_REQ_CMD;

    cmd.req_type = (WIFI_PRIV_REQ_E)type;
    cmd.param1 = param1;
    cmd.param2 = param2;
    cmd.param3 = param3;
    cmd.param4 = param4;
    cmd.result = result;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS))
        return MACIF_STATUS_ERROR;

    return MACIF_STATUS_SUCCESS;
}

/*!
    \brief      Set fixed rate
    \param[in]  sta_idx: index of the station
    \param[in]  fixed_rate_idx: index of the fixed rate
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_fix_rate_set(int sta_idx, int fixed_rate_idx)
{
    struct macif_cmd_rc_set_rate cmd;
    struct macif_cmd_resp resp;
    uint32_t rate_config_value;
    char buf[LINE_MAX_SZ];

    // Convert rate index into rate configuration
    if ((fixed_rate_idx < 0) || (fixed_rate_idx >= TOT_RATES)) {
        // disable fixed rate
        rate_config_value = (uint32_t)-1;
    } else if (macif_setting_rate_cfg_get(fixed_rate_idx, false, &rate_config_value, NULL)) {
        return MACIF_STATUS_ERROR;
    }
    wifi_rc_print_rate(buf, LINE_MAX_SZ, rate_config_value, 0, NULL);
    netlink_printf("%s\r\n", buf);

    // prepare RC_SET_RATE_CMD to send
    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_RC_SET_RATE_CMD;

    cmd.sta_idx = sta_idx;
    cmd.fixed_rate_cfg = (uint16_t)rate_config_value;

    // Send RC_SET_RATE_CMD
    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS)) {
        return MACIF_STATUS_ERROR;
    }
    return MACIF_STATUS_SUCCESS;
}

#ifdef CFG_TWT
/*!
    \brief      Config and start twt connection
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  param: pointer to the config of twt
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_twt_setup(int vif_idx, struct macif_twt_setup_t *param)
{
    struct macif_cmd_twt_setup_req cmd;
    struct macif_cmd_resp resp;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_TWT_SETUP_REQ_CMD;
    cmd.vif_idx = vif_idx;
    sys_memcpy(&cmd.param, param, sizeof(struct macif_twt_setup_t));

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS)) {
        return -1;
    }
    return 0;
}

/*!
    \brief      Config and start twt connection
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  id: index of the twt connection
    \param[in]  neg_type: type of twt negotiation
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_twt_teardown(int vif_idx, uint8_t id, uint8_t neg_type)
{
    struct macif_cmd_twt_teardown_req cmd;
    struct macif_cmd_resp resp;

    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_TWT_TEARDOWN_REQ_CMD;

    cmd.vif_idx = vif_idx;
    cmd.all_twt = 0;
    cmd.id = id;
    cmd.neg_type = neg_type;

    if (macif_cmd_send(&cmd.hdr, &resp.hdr) ||
        (resp.status != MACIF_STATUS_SUCCESS)) {
        return -1;
    }
    return 0;
}
#endif /* CFG_TWT */

#ifndef CONFIG_WPA_SUPPLICANT
/*!
    \brief      Connect to an AP
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  cfg: pointer to the information of AP
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_connect_req(int vif_idx, struct sta_cfg *cfg)
{
    struct wifi_vif_tag *wvif;
    struct mac_scan_result candidate;
    struct macif_cmd_connect cmd;
    struct sta_cfg *sta_cfg;
    struct macif_cmd_resp resp;
    int ret = -1, res;
    uint16_t mfp;

    if ((vif_idx >= CFG_VIF_NUM) || (NULL == cfg)) {
        return WIFI_MGMT_CONN_UNSPECIFIED;
    }

    if (VIF_STA != macif_vif_type_get(vif_idx)) {
        return WIFI_MGMT_CONN_UNSPECIFIED;
    }

    wvif =  &wifi_vif_tab[vif_idx];
    sta_cfg = &wvif->sta.cfg;

    /* find candidate ap from scan results */
    sys_memset(&candidate, 0, sizeof(struct mac_scan_result));
    if (cfg->conn_with_bssid)
        ret = wifi_netlink_candidate_ap_find(vif_idx, cfg->bssid, NULL, &candidate);
    else
        ret = wifi_netlink_candidate_ap_find(vif_idx, NULL, cfg->ssid, &candidate);
    if (ret) {
        return WIFI_MGMT_CONN_NO_AP;
    }
    wifi_netlink_scan_result_print(vif_idx, &candidate);

    /* Check if crypto matched */
    if ((cfg->passphrase_len != 0 && candidate.akm == CO_BIT(MAC_AKM_NONE))
        || (cfg->passphrase_len == 0 && candidate.akm != CO_BIT(MAC_AKM_NONE))) {
        return WIFI_MGMT_CONN_NO_AP;
    }

