NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    /* Complete connect info */
    if (sta_cfg != cfg) {
        /* Flush SAE PMK Cache if sta config changes */
        if ((candidate.akm & CO_BIT(MAC_AKM_SAE)) || (candidate.akm & CO_BIT(MAC_AKM_FT_OVER_SAE))) {
            if ((sta_cfg->ssid_len != cfg->ssid_len) || strcmp(sta_cfg->ssid, cfg->ssid) ||
                (sta_cfg->passphrase_len != cfg->passphrase_len) || strcmp(sta_cfg->passphrase, cfg->passphrase) ||
                (sta_cfg->akm != cfg->akm) || (sta_cfg->p_cipher != cfg->p_cipher) || (sta_cfg->g_cipher != cfg->g_cipher)) {
                sta_cfg->flush_cache_req = 1;
            }
        }

        sta_cfg->ssid_len = cfg->ssid_len;
        if (cfg->ssid_len)
            sys_memcpy(sta_cfg->ssid, cfg->ssid, cfg->ssid_len);
        sta_cfg->passphrase_len = cfg->passphrase_len;
        if (cfg->passphrase_len)
            sys_memcpy(sta_cfg->passphrase, cfg->passphrase, cfg->passphrase_len);
        sta_cfg->conn_with_bssid = cfg->conn_with_bssid;
        sys_memcpy(sta_cfg->bssid, cfg->bssid, WIFI_ALEN);
    }

    if (sta_cfg->flush_cache_req) {
        wifi_wpa_sta_pmksa_cache_flush(vif_idx, 0);
        sta_cfg->flush_cache_req = 0;
    }

    sta_cfg->akm = candidate.akm;
    sta_cfg->g_cipher = candidate.group_cipher;
    sta_cfg->p_cipher = candidate.pairwise_cipher;
    sta_cfg->channel = wifi_freq_to_channel(candidate.chan->freq);
    if (sta_cfg->conn_with_bssid) {
        sys_memcpy(sta_cfg->ssid, candidate.ssid.array, candidate.ssid.length);
        sta_cfg->ssid_len = candidate.ssid.length;
    } else {
        sys_memcpy(sta_cfg->bssid, (uint8_t *)candidate.bssid.array, WIFI_ALEN);
    }

    /* Check if pmksa cached */
    if ((candidate.akm & CO_BIT(MAC_AKM_SAE))
        && pmksa_cache_get(&wvif->sta.cache, (uint8_t *)candidate.bssid.array, NULL, WPA_KEY_MGMT_SAE)) {
        candidate.akm = CO_BIT(MAC_AKM_NONE);
    }

    sys_memset((void *)&cmd, 0, sizeof(cmd));
    cmd.hdr.len = sizeof(cmd);
    cmd.hdr.id = MACIF_CONNECT_CMD;
    cmd.vif_idx = vif_idx;
    cmd.chan.freq = candidate.chan->freq;
    cmd.chan.band = PHY_BAND_2G4;
    cmd.chan.flags = 0;
    cmd.chan.tx_power = 0;
    cmd.ssid.len = candidate.ssid.length;
    cmd.ssid.ssid = (const char *)candidate.ssid.array;
    cmd.bssid = (uint8_t *)candidate.bssid.array;
    cmd.uapsd = 0xFFFF;
    cmd.flags = CONTROL_PORT_HOST;

    mfp = (CO_BIT(MAC_CIPHER_BIP_CMAC_128) | CO_BIT(MAC_CIPHER_BIP_GMAC_128) |
           CO_BIT(MAC_CIPHER_BIP_GMAC_256) | CO_BIT(MAC_CIPHER_BIP_CMAC_256));

    if (candidate.group_cipher & mfp) {
        cmd.flags |= MFP_IN_USE;
    }

    if (cfg->akm & CO_BIT(MAC_AKM_NONE)){
        cmd.ie_len = 0;
        cmd.ie = NULL;
    } else {
        res = wifi_wpa_gen_wpa_or_rsn_ie(vif_idx);
        if (res) {
            ret = WIFI_MGMT_CONN_UNSPECIFIED;
            goto fail;
        } else {
            cmd.ie = wvif->sta.w_eapol.assoc_wpa_ie;
            cmd.ie_len = wvif->sta.w_eapol.assoc_wpa_ie_len;
            cmd.flags |= USE_PAIRWISE_KEY;
        }
    }

    if ((candidate.akm & CO_BIT(MAC_AKM_SAE)) || (candidate.akm & CO_BIT(MAC_AKM_FT_OVER_SAE))) {
        cmd.auth_alg = MAC_AUTH_ALGO_SAE;
    } else if (candidate.akm == CO_BIT(MAC_AKM_PRE_RSN)) {
        cmd.auth_alg = MAC_AUTH_ALGO_SHARED;
    } else{
        cmd.auth_alg = MAC_AUTH_ALGO_OPEN;
    }

    cmd.ctrl_port_ethertype = htons(ETH_P_PAE);

    if (candidate.akm != CO_BIT(MAC_AKM_NONE)) {
        cmd.flags |= USE_PRIVACY;
    }

    if ((candidate.pairwise_cipher == CO_BIT(MAC_CIPHER_WEP40)) ||
        (candidate.pairwise_cipher == CO_BIT(MAC_CIPHER_TKIP)) ||
        (candidate.pairwise_cipher == CO_BIT(MAC_CIPHER_WEP104))) {
        cmd.flags |= DISABLE_HT;
    }

    if (macif_ctl_cmd_execute(&cmd.hdr, &resp.hdr)
        || resp.status != MACIF_STATUS_SUCCESS) {
        ret = WIFI_MGMT_CONN_ASSOC_FAIL;
        goto fail;
    }

fail:
    return ret;
}

/*!
    \brief      indicate that association is completed
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  ind_param: pointer to the information of association
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_associate_done(int vif_idx, void *ind_param)
{
    struct macif_connect_ind *ind_info = (struct macif_connect_ind *)ind_param;
    struct wifi_vif_tag *wvif = &wifi_vif_tab[vif_idx];
    struct wifi_sta *config_sta = &wvif->sta;
    config_sta->ap_id = ind_info->ap_idx;
    config_sta->aid = ind_info->aid;
    #ifdef CFG_WIFI_RX_STATS
    macif_alloc_rx_rates(config_sta->ap_id);
    #endif
    macif_tx_sta_add(config_sta->ap_id, 0);
    net_if_up(&wvif->net_if);

    if (config_sta->cfg.akm != CO_BIT(MAC_AKM_NONE)) {
        // netlink_printf("Start WPA handshaking\r\n");
        wifi_wpa_sta_sm_step(vif_idx, WIFI_MGMT_EVENT_ASSOC_SUCCESS,
                        ((uint8_t *)ind_info->assoc_ie_buf + ind_info->assoc_req_ie_len),
                        ind_info->assoc_rsp_ie_len, WIFI_STA_SM_EAPOL);
    } else {
        // netlink_printf("Connect Successful, Aid %d\r\n", ind_info->aid);
        wpas_set_mac_ctrl_port(vif_idx, NULL, 1);
    }

    return 0;
}

/*!
    \brief      Disconnect with AP
    \param[in]  vif_idx: index of the wifi vif
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_disconnect_req(int vif_idx)
{
    struct wifi_vif_tag *wvif;
    struct macif_cmd_disconnect dc_cmd;
    struct wifi_ip_addr_cfg ip_cfg;
    struct macif_cmd_resp resp;

    if (vif_idx >= CFG_VIF_NUM) {
        return -1;
    }
    wvif =  &wifi_vif_tab[vif_idx];

    sys_memset(&ip_cfg, 0, sizeof(ip_cfg));
    ip_cfg.mode = IP_ADDR_NONE;
#ifdef CONFIG_IPV6_SUPPORT
    ip_cfg.ip6_mode = IP6_ADDR_NONE;
#endif
    wifi_set_vif_ip(vif_idx, &ip_cfg);
    net_if_down(&wvif->net_if);

    /* execute disconnect cmd */
    sys_memset((void *)&dc_cmd, 0, sizeof(dc_cmd));
    dc_cmd.hdr.len = sizeof(dc_cmd);
    dc_cmd.hdr.id = MACIF_DISCONNECT_CMD;
    dc_cmd.vif_idx = vif_idx;
    macif_ctl_cmd_execute(&dc_cmd.hdr, &resp.hdr);

    wifi_wpa_sta_sm_step(vif_idx, WIFI_MGMT_EVENT_DISCONNECT, NULL, 0, WIFI_STA_SM_SAE);
    wifi_wpa_sta_sm_step(vif_idx, WIFI_MGMT_EVENT_DISCONNECT, NULL, 0, WIFI_STA_SM_EAPOL);

