NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    if (wvif->sta.ap_id < CFG_STA_NUM) {
        #ifdef CFG_WIFI_RX_STATS
        macif_free_rx_rates(wvif->sta.ap_id);
        #endif
        macif_tx_sta_del(wvif->sta.ap_id);
    }

    return 0;
}

/*!
    \brief      wifi netlink forward message from wpa supplicant or macif control task
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  msg: pointer to the wpa message or macif message
    \param[in]  from_wpa: 1 from wpa supplicant and 0 from macif control task
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_msg_forward(int vif_idx, void *msg, bool from_wpa)
{
    uint16_t mgmt_event;
    struct macif_msg_hdr *hdr = (struct macif_msg_hdr *)msg;
    int reason = 0;
    uint32_t len = 0;
    uint8_t *param = NULL;
    struct wifi_vif_tag *wvif = vif_idx_to_wvif(vif_idx);

    WIFI_CLOSED_CHECK(0);

    if (msg == NULL || wvif == NULL)
        return -1;

    if (from_wpa) {
        //TODO
    } else {
        // netlink_printf("===> %s: id = %d\r\n", __func__, hdr->id);
        switch (hdr->id) {
        case MACIF_SCAN_RESULT_EVENT:
        {
            struct macif_scan_result_event *evt = (struct macif_scan_result_event *)msg;
            mgmt_event = WIFI_MGMT_EVENT_SCAN_RESULT;
            reason = 0;
            param = evt->payload;
            len = evt->length;
            break;
        }
        case MACIF_SCAN_DONE_EVENT:
            reason = ((struct macif_scan_completed_event *)msg)->status;
            if (reason == MACIF_STATUS_SUCCESS)
                mgmt_event = WIFI_MGMT_EVENT_SCAN_DONE;
            else
                mgmt_event = WIFI_MGMT_EVENT_SCAN_FAIL;
            break;
        case MACIF_CONNECT_EVENT:
        {
            struct macif_connect_ind *ind = (struct macif_connect_ind *)msg;

            if (ind->status_code == MACIF_STATUS_SUCCESS) {
                mgmt_event = WIFI_MGMT_EVENT_ASSOC_SUCCESS;
            } else {
                if (ind->status_code == WLAN_STATUS_INVALID_PMKID) {
                    /* When assoc rsp status code is 53, we should flush PMK */
                    wvif->sta.cfg.flush_cache_req = 1;
                    reason = WIFI_MGMT_CONN_ASSOC_FAIL;
                } else {
                    netlink_printf("Connect fail status code %d!\r\n", ind->status_code);
                    reason = WIFI_MGMT_CONN_UNSPECIFIED;
                }
                mgmt_event = WIFI_MGMT_EVENT_CONNECT_FAIL;
            }
            param = msg;
            len = sizeof(*ind) + ind->assoc_req_ie_len + ind->assoc_rsp_ie_len;
            break;
        }
        case MACIF_DISCONNECT_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_DISCONNECT;
            reason = ((struct macif_disconnect_event *)msg)->reason_code;

            if (reason == WLAN_REASON_CLASS2_FRAME_FROM_NONAUTH_STA ||
                reason == WLAN_REASON_CLASS3_FRAME_FROM_NONASSOC_STA ||
                reason == WLAN_REASON_DISASSOC_STA_HAS_LEFT ||
                reason == WLAN_REASON_DEAUTH_LEAVING) {
                reason = WIFI_MGMT_DISCON_RECV_DEAUTH;
            } else if (reason == WLAN_REASON_UNSPECIFIED) { // generated by macsw
                reason = WIFI_MGMT_DISCON_NO_BEACON;
            } else if (reason == WLAN_REASON_MICHAEL_MIC_FAILURE) {
                reason = WIFI_MGMT_DISCON_MIC_FAIL;
            } else if (reason == MAC_RS_RESERVED) { // disconnect from host
                reason = WIFI_MGMT_DISCON_FROM_UI;
            } else if (reason == WLAN_REASON_4WAY_HANDSHAKE_TIMEOUT) {
                reason = WIFI_MGMT_CONN_HANDSHAKE_FAIL;
            } else if (reason == WLAN_REASON_PREV_AUTH_NOT_VALID) {
                reason = WIFI_MGMT_CONN_AUTH_FAIL;
            } else {
                netlink_printf("Disconnect reason %d!\r\n", reason);
                reason = WIFI_MGMT_DISCON_UNSPECIFIED;
            }
            break;
        case MACIF_ROAMING_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_ROAMING_START;
            break;
        case MACIF_DHCP_START_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_DHCP_START;
            break;
        case MACIF_EXTERNAL_AUTH_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_EXTERNAL_AUTH_REQUIRED;
            break;
        default:
            netlink_printf("Unknown event(%d) from wlan lib!\r\n", hdr->id);
            return 0;
        }

        return eloop_message_send(vif_idx, mgmt_event, reason, param, len);
    }
    return 0;
}

#else  /* CONFIG_WPA_SUPPLICANT */
/*!
    \brief      Connect to an AP
    \param[in]  vif_idx: index of the wifi vif
    \param[in]  cfg: pointer to the information of AP
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_connect_req(int vif_idx, struct sta_cfg *cfg)
{
    struct wifi_vif_tag *wvif;
    struct sta_cfg *sta_cfg;
    struct mac_scan_result candidate;
    int res = -1;
    int network_change = 0;

    if ((vif_idx >= CFG_VIF_NUM) || (NULL == cfg)) {
        return WIFI_MGMT_CONN_UNSPECIFIED;
    }

    if (VIF_STA != macif_vif_type_get(vif_idx)) {
        return WIFI_MGMT_CONN_UNSPECIFIED;
    }

    wvif =  &wifi_vif_tab[vif_idx];
    sta_cfg = &wvif->sta.cfg;

    /* find candidate ap from scan results */
    sys_memset(&candidate, 0, sizeof(struct mac_scan_result));
    if (cfg->conn_with_bssid)
        res = wifi_netlink_candidate_ap_find(vif_idx, cfg->bssid, NULL, &candidate);
    else
        res = wifi_netlink_candidate_ap_find(vif_idx, NULL, cfg->ssid, &candidate);
    if (res ) {
        return WIFI_MGMT_CONN_NO_AP;
    }
    wifi_netlink_scan_result_print(0, &candidate);

    /* Check if crypto matched */
    if ((cfg->passphrase_len != 0 && candidate.akm == CO_BIT(MAC_AKM_NONE))
        || (cfg->passphrase_len == 0 && candidate.akm != CO_BIT(MAC_AKM_NONE))) {
        return WIFI_MGMT_CONN_NO_AP;
    }

    /* Complete connect info */
    if (sta_cfg != cfg) {
        sta_cfg->ssid_len = cfg->ssid_len;
        if (cfg->ssid_len)
            sys_memcpy(sta_cfg->ssid, cfg->ssid, cfg->ssid_len);
        sta_cfg->passphrase_len = cfg->passphrase_len;
        if (cfg->passphrase_len)
            sys_memcpy(sta_cfg->passphrase, cfg->passphrase, cfg->passphrase_len);
        sta_cfg->conn_with_bssid = cfg->conn_with_bssid;
        sys_memcpy(sta_cfg->bssid, cfg->bssid, WIFI_ALEN);
    }
    sta_cfg->akm = candidate.akm;
    sta_cfg->g_cipher = candidate.group_cipher;
    sta_cfg->p_cipher = candidate.pairwise_cipher;
    sta_cfg->channel = wifi_freq_to_channel(candidate.chan->freq);
    if (sta_cfg->conn_with_bssid) {
        sys_memcpy(sta_cfg->ssid, candidate.ssid.array, candidate.ssid.length);
        sta_cfg->ssid_len = candidate.ssid.length;
    } else {
        sys_memcpy(sta_cfg->bssid, (uint8_t *)candidate.bssid.array, WIFI_ALEN);
    }

    //check. if there is a wpa interface existed
    if (WIFI_WPA_STATE_STOPPED != wifi_wpa_get_state(vif_idx) && WVIF_STA == wvif->wvif_type) {
        network_change = wifi_wpa_check_network(vif_idx, &wvif->sta);
        // network not changed, at least same ssid and password(can not judge bssid here)
        if (!network_change) {
            if (WIFI_WPA_STATE_NOT_CONNECTED == wifi_wpa_get_state(vif_idx)) {
                // network has been disabled, reenable it
                if (!wifi_wpa_enable_network(vif_idx, 0)) {
                    goto success;
                } else {
                    netlink_printf("reenable network failed, continue\r\n");
                    res = WIFI_MGMT_CONN_UNSPECIFIED;
                }
            } else {
                // network is connected or under connecting, disable it then reenable
                if ((!wifi_wpa_disable_network(vif_idx)) &&
                    (!wifi_wpa_enable_network(vif_idx, 0))) {
                        goto success;
                } else {
                    netlink_printf("disable or reenable network failed, continue\r\n");
                    res = WIFI_MGMT_CONN_UNSPECIFIED;
                }
            }
        }
    }

    wifi_wpa_remove_vif(vif_idx);

