NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    if (wifi_wpa_sta_cfg(vif_idx, sta_cfg)) {
        res = WIFI_MGMT_CONN_ASSOC_FAIL;
        goto end;
    }

success:
    res = 0;
end:
    return res;
}

int wifi_netlink_associate_done(int vif_idx, void *ind_param)
{

    return 0;
}

/*!
    \brief      Disconnect with AP
    \param[in]  vif_idx: index of the wifi vif
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_disconnect_req(int vif_idx)
{
    struct wifi_ip_addr_cfg ip_cfg;

    wifi_wpa_link_monitor(vif_idx, 0);

    sys_memset(&ip_cfg, 0, sizeof(ip_cfg));
    ip_cfg.mode = IP_ADDR_NONE;
#ifdef CONFIG_IPV6_SUPPORT
    ip_cfg.ip6_mode = IP6_ADDR_NONE;
#endif
    if (wifi_set_vif_ip(vif_idx, &ip_cfg))
        return -1;

    if (wifi_wpa_disable_network(vif_idx))
        return -2;

    return 0;
}

#ifdef CFG_FTM_INIT
/*!
    \brief      Start ftm
    \param[in]  vif_idx: index of the wifi vif
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_ftm_start(int vif_idx)
{
    struct mac_ftm_results res = {0};
    int i;

    if (vif_idx > CFG_STA_NUM)
        return -1;

    if (macif_cntrl_start_ftm(vif_idx, &res))
        return -1;

    netlink_printf("FTM Response Number: %u\r\n", res.nb_ftm_rsp);
    for (i = 0; i < res.nb_ftm_rsp; i++) {
        netlink_printf("[%d]: "MAC_FMT" rtt %u\r\n",
                        i, MAC_ARG(res.meas[i].addr.array), res.meas[i].rtt);
    }
    netlink_printf("\r\n");

    return 0;
}
#endif /* CFG_FTM_INIT */

/*!
    \brief      wifi netlink forward message from wpa supplicant or macif control task
    \param[in]  vif_idx: wifi vif index
    \param[in]  msg: wpa message or macif message
    \param[in]  from_wpa: 1 from wpa supplicant and 0 from macif control task
    \retval     function run status
                  -1: error happen
                  0: run success
*/
int wifi_netlink_msg_forward(int vif_idx, void *msg, bool from_wpa)
{
    uint16_t mgmt_event = 0;
    int reason = 0;
    int16_t event_param = 0;
    uint8_t *param = NULL;
    uint32_t len = 0;

    WIFI_CLOSED_CHECK(0);

    if (vif_idx >= CFG_VIF_NUM)
        return -1;

    if (from_wpa) {
        struct wifi_wpa_target_event *wpa_msg = (struct wifi_wpa_target_event *)msg;

        switch (wpa_msg->event) {
        case WIFI_WPA_CONNECTED:
            //sys_memcpy((uint8_t *)&wifi_mgmt.connected_ap_info.ssid, (uint8_t *)&con_cfg->sta.ssid,
            //            sizeof(struct mac_ssid));
            //wifi_get_vif_status(WIFI_VIF_INDEX_DEFAULT, &vif_status);
            //sys_memcpy((uint8_t *)&wifi_mgmt.connected_ap_info.bssid, (uint8_t *)&vif_status.sta.bssid, MAC_ADDR_LEN);
            //wifi_mgmt.connected_ap_info.rssi = vif_status.sta.rssi;
            mgmt_event = WIFI_MGMT_EVENT_ASSOC_SUCCESS;
            reason = MACIF_STATUS_SUCCESS;
            break;
        case WIFI_WPA_PROCESS_ERROR:
            mgmt_event = WIFI_MGMT_EVENT_CONNECT_FAIL;
            event_param = *(int16_t *)wpa_msg->event_param;

            if (event_param == WIFI_WPA_ERROR_OTHERS) // SAE password wrong
                reason = WIFI_MGMT_CONN_AUTH_FAIL;
            else if (event_param == WIFI_WPA_ERROR_WRONG_KEY) // password wrong
                reason = WIFI_MGMT_CONN_HANDSHAKE_FAIL;
            else if (event_param == WIFI_WPA_ERROR_DPP)
                reason = WIFI_MGMT_CONN_DPP_FAIL;
            else if (event_param == WIFI_WPA_ERROR_NO_AP)
                reason = WIFI_MGMT_CONN_NO_AP;
            else {
                reason = WIFI_MGMT_CONN_UNSPECIFIED;
                netlink_printf("Connect fail reason %d!\r\n", event_param);
            }
            break;
        case WIFI_WPA_DISCONNECTED:
            mgmt_event = WIFI_MGMT_EVENT_DISCONNECT;
            event_param = *(int16_t *)wpa_msg->event_param;

            if (event_param == WLAN_REASON_CLASS2_FRAME_FROM_NONAUTH_STA ||
                event_param == WLAN_REASON_CLASS3_FRAME_FROM_NONASSOC_STA ||
                reason == WLAN_REASON_DISASSOC_STA_HAS_LEFT ||
                reason == WLAN_REASON_DEAUTH_LEAVING) {
                reason = WIFI_MGMT_DISCON_RECV_DEAUTH;
            } else if (event_param == WLAN_REASON_UNSPECIFIED) { // generated by macsw
                reason = WIFI_MGMT_DISCON_NO_BEACON;
            } else if (reason == WLAN_REASON_MICHAEL_MIC_FAILURE) {
                reason = WIFI_MGMT_DISCON_MIC_FAIL;
            } else {
                netlink_printf("Disconnect reason %d!\r\n", event_param);
                reason = WIFI_MGMT_DISCON_UNSPECIFIED;
            }
            break;
        default:
            return -1;
        }
    } else {
        struct macif_msg_hdr *msg_hdr = (struct macif_msg_hdr *)msg;

        switch (msg_hdr->id) {
        case MACIF_SCAN_DONE_EVENT:
        {
            struct macif_scan_completed_event *scan_res = (struct macif_scan_completed_event *)msg_hdr;

            if (scan_res->status != MACIF_STATUS_SUCCESS ||
                scan_res->vif_idx != WIFI_VIF_INDEX_DEFAULT) {
                mgmt_event = WIFI_MGMT_EVENT_SCAN_FAIL;
            } else {
                mgmt_event = WIFI_MGMT_EVENT_SCAN_DONE;
            }
            reason = scan_res->status;
            break;
        }
        case MACIF_DISCONNECT_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_DISCONNECT;
            reason = ((struct macif_disconnect_event *)msg)->reason_code;
            break;
        case MACIF_ROAMING_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_ROAMING_START;
            break;
        case MACIF_DHCP_START_EVENT:
            wifi_wpa_link_monitor(vif_idx, 1);
            mgmt_event = WIFI_MGMT_EVENT_DHCP_START;
            break;
        case MACIF_EXTERNAL_AUTH_EVENT:
            mgmt_event = WIFI_MGMT_EVENT_EXTERNAL_AUTH_REQUIRED;
            break;
        default:
            netlink_printf("Unknown event(%d) from wlan lib!\r\n", msg_hdr->id);
            return 0;
        }
    }

    if (eloop_message_send(vif_idx, mgmt_event, reason, param, len)) {
        netlink_printf("%s: eloop_message_send failed\r\n", __func__);
        return -1;
    }

