NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/wifi_manager/wifi_netlink.c
    return 0;
}
#endif  /* CONFIG_WPA_SUPPLICANT */

/*!
    \brief      Start wifi netlink
    \param[in]  none
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_start(void)
{
#ifndef CONFIG_WPA_SUPPLICANT
    struct mac_addr base_mac_addr;

    macif_ctl_base_addr_get(&base_mac_addr);

    if (wifi_vifs_init(&base_mac_addr))
        return -1;

    /* set rx management frame callback */
    macif_rx_set_mgmt_cb(wifi_wpa_rx_mgmt_cb, NULL);
    // macif_vif_wpa_rx_filter_set(WIFI_VIF_INDEX_DEFAULT, STA_MGMT_RX_FILTER);

    /* Default initialize VIF-0 as monitor mode */
    wifi_vif_tab[WIFI_VIF_INDEX_DEFAULT].wvif_type = WVIF_MONITOR;
    if (macif_ctl_start(WIFI_VIF_INDEX_DEFAULT, VIF_MONITOR)) {
        netlink_printf("%s: macif ctl start failed!!!\r\n", __func__);
    }
#else
    wifi_vif_tab[WIFI_VIF_INDEX_DEFAULT].wvif_type = WVIF_MONITOR;
#endif
    return 0;
}

/*!
    \brief      Stop wifi netlink
    \param[in]  none
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
void wifi_netlink_stop(void)
{
    struct wifi_vif_tag *wvif;
    int vif_idx;

    macif_rx_set_mgmt_cb(NULL, NULL);

    /* deinitialize wifi virtue interfaces */
    for (vif_idx = 0; vif_idx < CFG_VIF_NUM; vif_idx++)
    {
        wvif = (struct wifi_vif_tag *)vif_idx_to_wvif(vif_idx);

        if ((wvif->wvif_type == WVIF_AP) || (wvif->wvif_type == WVIF_MONITOR)) {
            eloop_message_send(vif_idx, WIFI_MGMT_EVENT_SWITCH_MODE_CMD, WVIF_STA, NULL, 0);
        } else if (wvif->wvif_type == WVIF_STA) {
            eloop_event_send(vif_idx, WIFI_MGMT_EVENT_DISCONNECT_CMD);
        }
        wifi_wpa_sta_pmksa_cache_flush(vif_idx, 1);
    }

}

/*!
    \brief      Open wifi device
    \param[in]  none
    \param[out] none
    \retval     0 on success and != 0 if error occured.
*/
int wifi_netlink_wifi_open(void)
{
    int ret = 0;

    if (wifi_work_status == WIFI_CLOSED) {
        /* WiFi PMU/RCC config */
        ret = wifi_power_on();
        if (ret)
            return ret;

        /* WiFi enable IRQ */
        wifi_irq_enable();

        /* Create WiFi related tasks and start */
        ret = wifi_sw_init();
        if (ret)
            return ret;

        /* Wait all tasks ready */
        wifi_wait_ready();

        netlink_printf("WiFi opened.\r\n");
        wifi_work_status = WIFI_RUNNING;
    } else {
        netlink_printf("WiFi is already running.\r\n");
    }
    return 0;
}

/*!
    \brief      Close wifi device
    \param[in]  none
    \param[out] none
    \retval     none
*/
void wifi_netlink_wifi_close(void)
{
    if (wifi_work_status == WIFI_RUNNING) {
        wifi_work_status = WIFI_CLOSING;

        /* AP/monitor stopped or STA disconnected */
        wifi_netlink_stop();

        /* Shut down wifi tasks and free related resources */
        wifi_sw_deinit();
        sys_ms_sleep(5);  /* Wait idle task to process list xTasksWaitingTermination */

        /* WiFi disable IRQ */
        wifi_irq_disable();

        /* WiFi RCC/PMU off */
        wifi_power_off();

        netlink_printf("WiFi closed.\r\n");
        wifi_work_status = WIFI_CLOSED;
    } else {
        netlink_printf("WiFi is already closed.\r\n");
    }
}
